<a href="https://colab.research.google.com/github/JakeOh/202105_itw_bd26/blob/main/lab_da/da11_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# DataFrame 합치기

* merge(join): 두 개의 DataFrame을 공통된 컬럼(들)을 기준으로 합치는 것.
* concat: DataFrame을 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [3]:
emp = pd.DataFrame({
    'empno': [100, 101, 102, 103],
    'ename': ['Scott', 'King', 'Allen', 'Tiger'],
    'deptno': [10, 20, 10, 50]
})
emp

   empno  ename  deptno
0    100  Scott      10
1    101   King      20
2    102  Allen      10
3    103  Tiger      50

In [4]:
dept = pd.DataFrame({
    'deptno': [10, 20, 30],
    'dname': ['IT', 'HR', 'Sales']
})
dept

   deptno  dname
0      10     IT
1      20     HR
2      30  Sales

In [7]:
# pd.merge 함수
pd.merge(emp, dept, how='inner', on='deptno')
# how: join 방식. inner, left, right, outer. inner는 생략가능(default argument)
# on: join의 기준이 되는 컬럼(들의 리스트). 컬럼 이름이 같은 경우에는 on도 생략 가능.

   empno  ename  deptno dname
0    100  Scott      10    IT
1    102  Allen      10    IT
2    101   King      20    HR

In [9]:
# pd.DataFrame.merge 메서드
emp.merge(dept)

   empno  ename  deptno dname
0    100  Scott      10    IT
1    102  Allen      10    IT
2    101   King      20    HR

In [10]:
# left (outer) join
pd.merge(emp, dept, how='left')  # on='deptno' 생략 가능.

   empno  ename  deptno dname
0    100  Scott      10    IT
1    101   King      20    HR
2    102  Allen      10    IT
3    103  Tiger      50   NaN

In [12]:
# right (outer) join
pd.merge(emp, dept, how='right')

   empno  ename  deptno  dname
0  100.0  Scott      10     IT
1  102.0  Allen      10     IT
2  101.0   King      20     HR
3    NaN    NaN      30  Sales

In [13]:
# full outer join
pd.merge(emp, dept, how='outer')

   empno  ename  deptno  dname
0  100.0  Scott      10     IT
1  102.0  Allen      10     IT
2  101.0   King      20     HR
3  103.0  Tiger      50    NaN
4    NaN    NaN      30  Sales

join 기준이 되는 컬럼 이름이 서로 다른 경우

In [14]:
employees = pd.DataFrame({
    'empno': [100, 101, 102, 103],
    'ename': ['Scott', 'King', 'Allen', 'Tiger'],
    'deptno': [10, 20, 10, 50]
})
employees

   empno  ename  deptno
0    100  Scott      10
1    101   King      20
2    102  Allen      10
3    103  Tiger      50

In [15]:
departments = pd.DataFrame({
    'dno': [10, 20, 30],
    'dname': ['IT', 'HR', 'Sales']
})
departments

   dno  dname
0   10     IT
1   20     HR
2   30  Sales

In [16]:
pd.merge(employees, departments, how='inner', left_on='deptno', right_on='dno')

   empno  ename  deptno  dno dname
0    100  Scott      10   10    IT
1    102  Allen      10   10    IT
2    101   King      20   20    HR

인덱스를 사용한 merge

In [18]:
np.random.seed(1)

df1 = pd.DataFrame(data={'value1': np.random.randint(10, size=6), 
                         'value2': np.random.randint(100, size=6)},
                   index=['a', 'b', 'c'] * 2)
df1

   value1  value2
a       5       1
b       8      76
c       9      71
a       5       6
b       0      25
c       0      50

In [19]:
np.random.seed(2)

df2 = pd.DataFrame(data={'data1': np.random.rand(3),
                         'data2': np.random.randn(3)},
                   index=['a', 'b', 'c'])
df2

      data1     data2
a  0.435995 -1.953796
b  0.025926 -1.586882
c  0.549662 -1.074456

In [20]:
pd.merge(df1, df2, how='inner', left_index=True, right_index=True)

   value1  value2     data1     data2
a       5       1  0.435995 -1.953796
a       5       6  0.435995 -1.953796
b       8      76  0.025926 -1.586882
b       0      25  0.025926 -1.586882
c       9      71  0.549662 -1.074456
c       0      50  0.549662 -1.074456